Revit 2024 API
TableCellStyle.FontVerticalAlignment Property
 The vertical alignment style of text font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public VerticalAlignmentStyle FontVerticalAlignment { get; set; }
Visual Basic
Public Property FontVerticalAlignment As VerticalAlignmentStyle
	Get
	Set
Visual C++
public:
property VerticalAlignmentStyle FontVerticalAlignment {
	VerticalAlignmentStyle get ();
	void set (VerticalAlignmentStyle value);
}
Field Value
 Alignment style.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace